In [3]:
import pandas as pd
import numpy as np
from pandas import DataFrame,Series

In [4]:
string_data=Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data.notna()

0     True
1     True
2    False
3     True
dtype: bool

In [7]:
string_data[0]=None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
string_data.dropna()
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [9]:
string_data.fillna('apple')

0        apple
1    artichoke
2        apple
3      avocado
dtype: object

In [10]:
from numpy import nan as NA
data=Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                     [NA,NA,NA],[NA,6.5,3.]]) 
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned=data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
df=DataFrame(np.random.randn(7,3))
df

          0         1         2
0  0.572657 -0.884854 -2.146100
1  1.639889 -1.431523 -0.810101
2 -0.362348 -0.318634 -0.926104
3  0.426907 -0.980179  0.432643
4 -1.601546 -0.480243  1.377371
5  1.126741 -1.305020 -0.434353
6  2.985811 -2.749401 -1.084428

In [17]:
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0  0.572657       NaN       NaN
1  1.639889       NaN       NaN
2 -0.362348       NaN -0.926104
3  0.426907       NaN  0.432643
4 -1.601546 -0.480243  1.377371
5  1.126741 -1.305020 -0.434353
6  2.985811 -2.749401 -1.084428

In [18]:
df.dropna()

          0         1         2
4 -1.601546 -0.480243  1.377371
5  1.126741 -1.305020 -0.434353
6  2.985811 -2.749401 -1.084428

In [19]:
df.dropna(thresh=2) # 容忍2个缺失值

          0         1         2
2 -0.362348       NaN -0.926104
3  0.426907       NaN  0.432643
4 -1.601546 -0.480243  1.377371
5  1.126741 -1.305020 -0.434353
6  2.985811 -2.749401 -1.084428

In [20]:
df.fillna(0)

          0         1         2
0  0.572657  0.000000  0.000000
1  1.639889  0.000000  0.000000
2 -0.362348  0.000000 -0.926104
3  0.426907  0.000000  0.432643
4 -1.601546 -0.480243  1.377371
5  1.126741 -1.305020 -0.434353
6  2.985811 -2.749401 -1.084428

In [21]:
df.fillna({1:0.5,2:-1})

          0         1         2
0  0.572657  0.500000 -1.000000
1  1.639889  0.500000 -1.000000
2 -0.362348  0.500000 -0.926104
3  0.426907  0.500000  0.432643
4 -1.601546 -0.480243  1.377371
5  1.126741 -1.305020 -0.434353
6  2.985811 -2.749401 -1.084428

In [22]:
_=df.fillna(0,inplace=True)
df

          0         1         2
0  0.572657  0.000000  0.000000
1  1.639889  0.000000  0.000000
2 -0.362348  0.000000 -0.926104
3  0.426907  0.000000  0.432643
4 -1.601546 -0.480243  1.377371
5  1.126741 -1.305020 -0.434353
6  2.985811 -2.749401 -1.084428

In [23]:
df=DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA
df

          0         1         2
0 -1.297804  1.854321  0.517598
1 -0.181498 -0.027941 -0.394376
2  0.960614       NaN -0.786121
3  0.712583       NaN -1.238938
4  1.294365       NaN       NaN
5 -0.751911       NaN       NaN

In [24]:
df.fillna(method='ffill')

          0         1         2
0 -1.297804  1.854321  0.517598
1 -0.181498 -0.027941 -0.394376
2  0.960614 -0.027941 -0.786121
3  0.712583 -0.027941 -1.238938
4  1.294365 -0.027941 -1.238938
5 -0.751911 -0.027941 -1.238938

In [25]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -1.297804  1.854321  0.517598
1 -0.181498 -0.027941 -0.394376
2  0.960614 -0.027941 -0.786121
3  0.712583 -0.027941 -1.238938
4  1.294365       NaN -1.238938
5 -0.751911       NaN -1.238938

In [26]:
data=Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [27]:
data=DataFrame({'k1':['one','two']*3+['two'],
                'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [28]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [29]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [30]:
data['v1']=range(7)
print(data)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

    k1  k2  v1
0  one   1   0
1  two   1   1

In [31]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon',
                            'Pastrami','corned beef','Bacon',
                            'pastrami','honey ham','nova lox'],
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [32]:
meat_to_animal={
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}
lowercased=data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [33]:
data['animal']=lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [34]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [35]:
data=pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [36]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [37]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [38]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [39]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),
                    index=['Ohio','Colorado','New York'],
                    columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [40]:
transform=lambda x:x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [41]:
data.index=data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [42]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [43]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]
bins=[18,25,35,60,100]
cats=pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [44]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [45]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [46]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [47]:
cats=pd.cut(ages,[18,26,36,61,100],right=False)
cats

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [48]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [49]:
data=np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.1, 0.32], (0.32, 0.54], (0.54, 0.76], (0.1, 0.32], (0.54, 0.76], ..., (0.76, 0.98], (0.1, 0.32], (0.32, 0.54], (0.1, 0.32], (0.54, 0.76]]
Length: 20
Categories (4, interval[float64, right]): [(0.1, 0.32] < (0.32, 0.54] < (0.54, 0.76] < (0.76, 0.98]]

In [50]:
data=np.random.randn(1000)
cats=pd.qcut(data,4)
cats

[(-2.763, -0.625], (-0.0638, 0.594], (0.594, 3.04], (-0.0638, 0.594], (-2.763, -0.625], ..., (0.594, 3.04], (0.594, 3.04], (-0.625, -0.0638], (-2.763, -0.625], (-0.625, -0.0638]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.763, -0.625] < (-0.625, -0.0638] < (-0.0638, 0.594] < (0.594, 3.04]]

In [51]:
pd.value_counts(cats)

(-2.763, -0.625]     250
(-0.625, -0.0638]    250
(-0.0638, 0.594]     250
(0.594, 3.04]        250
dtype: int64

In [52]:
pd.value_counts(cats)

(-2.763, -0.625]     250
(-0.625, -0.0638]    250
(-0.0638, 0.594]     250
(0.594, 3.04]        250
dtype: int64

In [53]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(-1.178, -0.0638], (-0.0638, 1.144], (-0.0638, 1.144], (-0.0638, 1.144], (-2.763, -1.178], ..., (1.144, 3.04], (-0.0638, 1.144], (-1.178, -0.0638], (-2.763, -1.178], (-1.178, -0.0638]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.763, -1.178] < (-1.178, -0.0638] < (-0.0638, 1.144] < (1.144, 3.04]]

In [54]:
data=DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.035606    -0.052446     0.022570    -0.018064
std       1.034130     0.969286     1.005845     1.008011
min      -3.875613    -2.830686    -3.375532    -3.397127
25%      -0.693845    -0.740457    -0.629692    -0.658742
50%      -0.015536    -0.028353     0.022188     0.000682
75%       0.737750     0.617553     0.688109     0.672666
max       3.363403     3.032898     3.253784     2.909238

In [55]:
col=data[2]
col[np.abs(col)>3]

90     3.253784
384    3.035237
870   -3.375532
Name: 2, dtype: float64

In [56]:
data[(np.abs(data)>3).any(1)]

/var/folders/6l/0rnqwtgd2lqfvr4vcry4xjrc0000gn/T/ipykernel_36733/2768852463.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  data[(np.abs(data)>3).any(1)]

            0         1         2         3
11   3.175488 -1.053494  1.167714 -0.857581
27  -3.875613  0.390661  1.283053 -0.584291
89   3.044588  0.003717 -1.249068  0.260967
90   1.021449  0.741818  3.253784 -1.474442
253  3.015182  0.693584  0.335048  0.156644
384  1.357775  0.559287  3.035237  0.602491
470 -3.477469 -1.631834 -1.424119 -0.154341
499  3.363403 -0.988886 -0.175766 -0.427223
675  0.385082  0.039255 -1.583258 -3.397127
690 -0.807243  3.032898 -0.326144 -1.022490
870 -0.523651  0.375689 -3.375532 -1.758593
911  1.274798 -0.972448 -1.726610 -3.105948
960  3.029140 -0.797720  0.091762  1.068847

In [57]:
data[(np.abs(data)>3)]=np.sign(data)*3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.036331    -0.052479     0.022656    -0.017561
std       1.027771     0.969182     1.003754     1.006436
min      -3.000000    -2.830686    -3.000000    -3.000000
25%      -0.693845    -0.740457    -0.629692    -0.658742
50%      -0.015536    -0.028353     0.022188     0.000682
75%       0.737750     0.617553     0.688109     0.672666
max       3.000000     3.000000     3.000000     2.909238

In [58]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0 -1.0  1.0  1.0
2  1.0 -1.0 -1.0 -1.0
3  1.0 -1.0  1.0 -1.0
4  1.0 -1.0  1.0  1.0

In [59]:
df=DataFrame(np.arange(5*4).reshape(5,4))
sampler=np.random.permutation(5)
sampler

array([4, 1, 0, 3, 2])

In [60]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [61]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
0   0   1   2   3
3  12  13  14  15
2   8   9  10  11

In [62]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11

In [63]:
chioces=pd.Series([5,7,-1,6,4])
draws=chioces.sample(n=10,replace=True)
draws

2   -1
2   -1
3    6
4    4
4    4
2   -1
4    4
4    4
1    7
1    7
dtype: int64

In [64]:
df=DataFrame({'key':['b','b','a','c','a','b'],
                'data1':range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [65]:
dummy_ranks=pd.get_dummies(df['key'],prefix='key')
dummy_ranks

   key_a  key_b  key_c
0      0      1      0
1      0      1      0
2      1      0      0
3      0      0      1
4      1      0      0
5      0      1      0

In [66]:
np.random.seed(12345)
values=np.random.rand(10)
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [67]:
bins=[0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

In [68]:
val='a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [69]:
pieces=[x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [70]:
first,second,third=pieces
first+'::'+second+'::'+third

'a::b::guido'

In [71]:
'::'.join(pieces)

'a::b::guido'

In [72]:
'guido' in val

True

In [73]:
val.index(',')

1

In [74]:
val.find(':')

-1

In [75]:
val.count(',')

2

In [76]:
val.replace(',','')

'ab guido'

In [77]:
import re

In [78]:
test='foo   bar\t baz  \tqux'
re.split('\s+',test)

['foo', 'bar', 'baz', 'qux']

In [79]:
regex=re.compile('\s+')
regex.split(test)

['foo', 'bar', 'baz', 'qux']

In [80]:
regex.findall(test)

['   ', '\t ', '  \t']

In [81]:
text="""Dave
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern=r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
regex=re.compile(pattern,flags=re.IGNORECASE)
regex.findall(text)

['steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [88]:
m=regex.search(text)
m

In [89]:
print(regex.match(text))

None

In [90]:
print(regex.sub('REDACTED',text))

Dave
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [91]:
pattern=r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex=re.compile(pattern,flags=re.IGNORECASE)
m=regex.match('wesm@bright.com')
m.groups()

('wesm', 'bright', 'com')

In [92]:
regex.findall(text)

[('steve', 'gmail', 'com'), ('rob', 'gmail', 'com'), ('ryan', 'yahoo', 'com')]

In [93]:
print(regex.sub(r'Username:\1,Domain:\2,Suffix:\3',text))

Dave
Steve Username:steve,Domain:gmail,Suffix:com
Rob Username:rob,Domain:gmail,Suffix:com
Ryan Username:ryan,Domain:yahoo,Suffix:com

In [94]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [95]:
data=Series(data)

In [96]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [97]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [98]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [99]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [100]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object